QGDsolver/tutorials/QGDFoam/2D/LandenburgJet60psi/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiQGDThermo;
    mixture         pureMixture;
    transport       sutherland;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight       28.96;
    }
    thermodynamics
    {
        Cp              1004.5;
        Hf              0;
        Tref            0;
    }
    transport
    {
        As              1.458e-06;
        Ts              110.4;
        Pr              1;
    }
}

QGD
{
    implicitDiffusion true;
    QGDCoeffs constScPrModel1;
    constScPrModel1Dict
    {
        ScQGD 1; //0.1 - for correction after reaching steady-state solution
        PrQGD 1;
    }
}
                                    


// ************************************************************************* //
